In [2]:
import pandas as pd
import numpy as np

In [3]:
sozlukVerisi  = {"İstanbul": [30,29,np.nan] ,"Ankara": [20,np.nan,25] ,"İzmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
havaDurumuDataFrame.dropna()

   İstanbul  Ankara  İzmir
0      30.0    20.0     40

In [6]:
havaDurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [7]:
havaDurumuDataFrame.dropna(axis = 1)

   İzmir
0     40
1     39
2     38

In [9]:
yeniVeri = {"İstanbul": [30,29,np.nan] ,"Ankara": [20,np.nan,25] ,"İzmir": [40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [10]:
yeniDataFrame

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [11]:
havaDurumuDataFrame.dropna(axis = 1,thresh = 2)

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [12]:
yeniDataFrame.fillna(20)

   İstanbul  Ankara  İzmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# groupby

In [21]:
maasSozlugu = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calısan İsmi": ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas": [600,150,200,300,400,500]
              }

In [22]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [23]:
maasDataFrame

   Departman Calısan İsmi  Maas
0    Yazılım        Ahmet   600
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [25]:
groupObject = maasDataFrame.groupby("Departman")

In [26]:
groupObject.count()

           Calısan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [27]:
groupObject.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    375.0

In [28]:
groupObject.min()

          Calısan İsmi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   150

In [29]:
groupObject.max()

          Calısan İsmi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   600

In [30]:
groupObject.describe()

           Maas
          count   mean         std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  375.0  318.198052  150.0  262.5  375.0  487.5  600.0